РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПеремещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ASP_ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение/Forms/ФормаДокумента/Ext/Form/Module.bsl
//+++ASP_yulia_l_04/10/2021_ 000012681
&НаКлиенте
Процедура асп_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбработкаВыбораНазначения" Тогда
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		
		Если ТекущиеДанные.КоличествоУпаковок > Параметр Тогда     //разбиваем строку
			
			НовСтрока = Объект.Товары.Добавить() ;
			КодСтроки = ПолучитьМаксимальныйКОдСтроки();
			ЗаполнитьЗначенияСвойств(НовСтрока,ТекущиеДанные);
			Разница = НовСтрока.Количество - Параметр;
			ТекущиеДанные.Количество = Разница;
			ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество;
			НовСтрока.Количество = Параметр;
			НовСтрока.КоличествоУпаковок = НовСтрока.Количество;
			НовСтрока.КодСтроки = КодСтроки; 
			//пересчитать сумму (типовое)
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
			
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовСтрока, СтруктураДействий, КэшированныеЗначения);

		КонецЕсли;	
	КонецЕсли;	
 
КонецПроцедуры
//---ASP_yulia_l_04/10/2021_ 000012681

//ASP_Petrov 01.11.2021 + 000013050
&НаСервере
Функция ПолучитьМаксимальныйКОдСтроки()
	ТЗКод = Объект.Товары.Выгрузить(,"КодСтроки");
	ТзКод.Сортировать("КодСтроки Убыв");
	КодСтроки = ТзКод[0].КодСтроки; 
	Объект.МаксимальныйКодСтроки = КодСтроки + 1;
	Возврат КодСтроки + 1;

КонецФункции

&НаКлиенте
Процедура асп_ТоварыНазначениеОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаНов = ПолучитьМаксимальныйНомерСтроки();
	Если не Объект.Товары.Количество() = СтрокаНов тогда
		СтрокаТЧ = Объект.Товары[Объект.Товары.Количество() - 1];
		СтрокаТч.Назначение = ВыбранноеЗначение;
		ВыбранноеЗначение = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция ПолучитьМаксимальныйНомерСтроки()
	
	Возврат Объект.Ссылка.Товары.Количество();
	
КонецФункции	
//ASP_Petrov 01.11.2021 -
